MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL26Z32VFM4/mcu.h
#define ENTRY                         0x7FFFFFFF80000000      // Entry 0 (MTB) is hardwired to 0xFFFF_E003; Entry 1 (MTBDWT) to 0xFFFF_F003; Entry 2 (CM0+ ROM Table) to 0xF00F_D003


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_TABLEMARK register.
//
//*****************************************************************************

#define MARK                          0x7FFFFFFF80000000      // Hardwired to 0x0000_0000


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_SYSACCESS register.
//
//*****************************************************************************

#define SYSACCESS                     0x7FFFFFFF80000000      // Hardwired to 0x0000_0001


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_PERIPHIDn register.
//
//*****************************************************************************

#define PERIPHID                      0x7FFFFFFF80000000      // Peripheral ID1 is hardwired to 0x0000_00E0; ID2 to 0x0000_0008; and all the others to 0x0000_0000


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_COMPIDn register.
//
//*****************************************************************************

#define COMPID                        0x7FFFFFFF80000000      // Component ID0 is hardwired to 0x0000_000D; ID1 to 0x0000_0010; ID2 to 0x0000_0005; ID3 to 0x0000_00B1


//*****************************************************************************
//
// The following are defines for the bit fields in the DMAMUXx_CHCFGn register.
//
//*****************************************************************************

#define ENBL                          0x00000080      // DMA Channel Enable
#define TRIG                          0x00000040      // DMA Channel Trigger Enable
#define SOURCE                        0x000007E0      // DMA Channel Source (Slot)


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_SARn register.
//
//*****************************************************************************

#define SAR                           0x7FFFFFFF80000000      // Each SAR contains the byte address used by the DMA controller to read data. The SARn is typically aligned on a 0-modulo-ssize boundarythat is, on the natural alignment of the source data.


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_DARn register.
//
//*****************************************************************************

#define DAR                           0x7FFFFFFF80000000      // Each DAR contains the byte address used by the DMA controller to write data. The DARn is typically aligned on a 0-modulo-dsize boundarythat is, on the natural alignment of the destination data.


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_DSR_BCRn register.
//
//*****************************************************************************

#define CE                            0x40000000      // Configuration Error
#define BES                           0x20000000      // Bus Error on Source
#define BED                           0x10000000      // Bus Error on Destination
#define REQ                           0x04000000      // Request
#define BSY                           0x02000000      // Busy
#define DONE                          0x01000000      // Transactions Done
#define BCR                           0x7FFFFF800000      // This field contains the number of bytes yet to be transferred for a given block.


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_DCRn register.
//
//*****************************************************************************

#define EINT                          0x80000000      // Enable Interrupt on Completion of Transfer
#define ERQ                           0x40000000      // Enable Peripheral Request
#define CS                            0x20000000      // Cycle Steal
#define AA                            0x10000000      // Auto-align
#define SSIZE                         0x0C000000      // 
#define DINC                          0x03000000      // 
#define DSIZE                         0x00C00000      // 
#define START                         0x00100000      // 
#define EADREQ                        0x00180000      // 
#define SMOD                          0x00060000      // 
#define DMOD                          0x00018000      // 
#define D_REQ                         0x00006000      // 
#define LINKCC                        0x00001800      // 
#define LCH1                          0x00000600      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the OSC0_CR register.
//
//*****************************************************************************

#define ERCLKEN                       0x00000080      // External Reference Enable
#define EREFSTEN                      0x00000020      // External Reference Stop Enable
#define SC2P                          0x00000010      // Oscillator 2P Gain Control
#define SC4P                          0x00000008      // Oscillator 4P Gain Control
#define SC8P                          0x00000004      // Oscillator 8P Gain Control
#define SC16P                         0x00000002      // Oscillator 16P Gain Control


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_SC1n register.
//
//*****************************************************************************

#define COCO                          0x00000080      // Conversion Complete Flag
#define AIEN                          0x00000040      // Interrupt Enable
#define DIFF                          0x00000020      // Differential Mode Enable
#define ADCH                          0x000001F0      // Input channel select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CFG1 register.
//
//*****************************************************************************

#define ADLPC                         0x00000080      // Low-Power Configuration
#define ADIV                          0x000000C0      // Clock Divide Select
#define ADLSMP                        0x00000010      // Sample Time Configuration
#define MODE                          0x00000018      // Conversion mode selection
#define ADICLK                        0x00000006      // Input Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CFG2 register.
//
//*****************************************************************************

#define MUXSEL                        0x00000010      // ADC Mux Select
#define ADACKEN                       0x00000008      // Asynchronous Clock Output Enable
#define ADHSC                         0x00000004      // High-Speed Configuration
#define ADLSTS                        0x00000006      // Long Sample Time Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_Rn register.
//
//*****************************************************************************

#define D                             0x7FFF8000      // Data result


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CVn register.
//
//*****************************************************************************

#define CV                            0x7FFF8000      // Compare Value


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_SC2 register.
//
//*****************************************************************************

#define ADACT                         0x00000080      // Conversion Active
#define ADTRG                         0x00000040      // Conversion Trigger Select
#define ACFE                          0x00000020      // Compare Function Enable
#define ACFGT                         0x00000010      // Compare Function Greater Than Enable
#define ACREN                         0x00000008      // Compare Function Range Enable
#define DMAEN                         0x00000004      // DMA Enable
#define REFSEL                        0x00000006      // Voltage Reference Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_SC3 register.
//
//*****************************************************************************

#define CAL                           0x00000080      // Calibration
#define CALF                          0x00000040      // Calibration Failed Flag
#define ADCO                          0x00000008      // Continuous Conversion Enable
#define AVGE                          0x00000004      // Hardware Average Enable
#define AVGS                          0x00000006      // Hardware Average Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_OFS register.
//
//*****************************************************************************

#define OFS                           0x7FFF8000      // Offset Error Correction Value


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_PG register.
//
//*****************************************************************************

#define PG                            0x7FFF8000      // Plus-Side Gain


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_MG register.
//
//*****************************************************************************

